# 함수와 레코드

## 주석

```purescript
-- 한줄커멘트

{-
  멀티라인 커멘트
-}
```

## 기본 타입

Prim 모듈에 정의된, 자바스크립트에 대응되는 타입들

```purescript
$ spago repl

> :type 1.0
Number

> :type "test"
String

> :type true
Boolean
```

`:type` 을 이용하여 기본 타입의을 출력할 수 있음

### purescript의 내장 타입들

- Int
- Char
- Array
  - Javascript의 것과 비슷하지만, 모든 요소가 같은 타입이어야 합니다.

```purescript
> :type [1, 2, 3]
Array Int

> :type [true, false]
Array Boolean

> :type [1, false]
Error found:
in module $PSCI
at :1:1 - 1:10 (line 1, column 1 - line 1, column 10)

  Could not match type

    Int

  with type

    Boolean


while inferring the type of [ 1
                            , false
                            ]
in value declaration it

See https://github.com/purescript/documentation/blob/master/errors/TypesDoNotUnify.md for more information,
or to contribute content related to this error.
```

레코드는 자바스크립트의 객체에 대응되고, 자바스크립트의 리터럴 객체와 같은 신택스를 사용합니다.

```purescript
> author = { name: "Phil", interests: ["Functional Programming", "JavaScript"] }

> :type author
{ name :: String
, interests :: Array String
}
```

필드는 `.` 을 이용해서 접근이 가능합니다.

purescript의 함수는 javascript의 함수에 대응됩니다.

```purescript
> import Prelude
> :type flip
  forall a b c. (a -> b -> c) -> b -> a -> c

> :type const
forall a b. a -> b -> a
-- k combinator(kestrel combinator)
-- https://www.angelfire.com/tx4/cus/combinator/birds.html
```

함수 바로 위에 타입을 적을 수 있다.
함수는 인자 앞에 `=` 를 써서 파일 최상위에 작성될 수 있다.

```purescript
add :: Int -> Int -> Int
add x y = x + y
```

혹은, 인자 목록 앞에 `\` 를 이용하여 인라인으로 정의할 수 있다.
PSCi에서는 :paste 커맨드를 통해 paste 모드를 이용해서 사용할 수 있다. (종료는 control+D 이다)

## 정량화된 타입

```purescript
> import Prelude
> :type flip
  forall a b c. (a -> b -> c) -> b -> a -> c

> :type const
forall a b. a -> b -> a
-- k combinator(kestrel combinator)
```

위의 이 코드에서 `forall(∀)`키워드는 `flip`이 보편적으로 정량화된 타입을 가진다는 것을 의미합니다.
이는 a,b,c에 대해서 모든 타입으로 대체할 수 있고, flip이 이에 동작할 것이라는 것입니다.

> <'a,'b,'c> 같은거

이런 universally quantified type들은 결정되어질 수 있다.

```
(Int -> String -> String) -> String -> Int -> String
```

이러한 특수화는 암묵적으로 수행된다.

```purescript
-- <> 는 string concat
{-
> import Prelude
> "ab" <> "c"
"abc"
> "ab" <> 10
Error found:
in module $PSCI
at :1:9 - 1:11 (line 1, column 9 - line 1, column 11)

  Could not match type

    Int

  with type

    String


while checking that type Int
  is at least as general as type String
while checking that expression 10
  has type String
in value declaration it

-}

-- show 는 아래와 같음
{-
> :type show
forall (a :: Type). Show a => a -> String
-}
> flip (\n s -> show n <> s) "Ten" 10

"10Ten"
```

## 인덴트

퓨어스크립트는 파이썬,fsharp,haskell과 같이 인덴트 기반으로 블록을 구분한다.
where, of let 과 같은 키워드는 새 코드 블럭을 제시한다.

## 우리 타입 정의하기

주소록 타입은 다음과 같이 정의할 수 있다.

```purescript
type Address =
  { street  :: String
  , city    :: String
  , state   :: String
  }

type Entry =
  { firstName :: String
  , lastName  :: String
  , address   :: Address
  }

type AddressBook = List Entry
```

레코드로 구성된 각각의 주소, 엔트리 ( 여기서 레코드의 중첩을 볼 수 있다).
주소록은 단순히 엔트리의 리스트로 표현할 수 있다.

## 타입 생성자와 종류

위의 `List`는 타입 생성자이다.

`Nil`과 같은 값을 생성자에 넣으려 하면 _kind error_ 가 발생한다

```purescript
> import Data.List
> Nil :: List
Error found:
in module $PSCI
at <internal>:0:0 - 0:0 (line 0, column 0 - line 0, column 0)

  In a type-annotated expression x :: t, the type t must have kind Type.
  The error arises from the type

    List

  having the kind

    Type -> Type

  instead.

in value declaration it

See https://github.com/purescript/documentation/blob/master/errors/ExpectedType.md for more information,
or to contribute content related to this error.
```

이게 어떤 타입인지 알고 싶으면 `:kind`를 쓰라
(값의 타입을 알고싶으면 `:type`, 타입 alias의 값을 알고 싶으면 `:kind`)

## 주소록 엔트리 출력하기

주소록 엔트리를 출력하는 함수를 만들어보자.

```purescript
showEntry :: Entry -> String
-- 타입 시그니쳐
showEntry entry = entry.lastName <> ", " <>
                  entry.firstName <> ": " <>
                  showAddress entry.address

showAddress :: Address -> String
showAddress address = address.street <> ", " <>
                      address.city <> ", " <>
                      address.state
```

## 주소록 만들기

Data.List의 Cons 함수를 보자

```purescript
> import Data.List
> :type Cons
forall a. a -> List a -> List a
-- 이는 리스트에 값을 추가하는 것.
-- 모든 데이터가 불변이니까 이렇게 다룬다
```

## 커링

TLDR; 오토커링 되고 point-free style입니다 (올레~)

```purescript
insertEntry:: Entry -> AddressBook -> AddressBook
insertEntry = Cons

{-
위와 같이 함수의 마지막 인자를 작성하지 않는 것은 point-free 스타일이라 함
a.k.a. eta conversion
-}
```


## 속성 접근자

purescript 에서는 `_.속성이름` 의 형태로 레코드를 액세스 할 수 있는 람다를 제공

```purescript
> address = { street: "123 Fake St.", city: "Faketown", state: "CA" }
> entry = { firstName: "John", lastName: "Smith", address: address }
> _.lastName entry
"Smith"

-- is equivalent of
\entry -> entry.lastName

> _.address.city entry
"Faketown"

-- is equivalent of
\entry -> entry.address.city
```

## 주소록 쿼리하기

```purescript
> :type filter
forall a. (a -> Boolean) -> List a -> List a
-- a 타입에 대해서 predicator, targetList -> resultList

> :type head
forall a. List a -> Maybe a
-- a 타입에 대해서 List<a> 의 첫 요소 option<a> 타입 반환

findEntry :: String -> String -> AddressBook -> Maybe Entry
findEntry firstName lastName book = head (filter filterEntry book)
  where
    filterEntry :: Entry ->Boolean
    filterEntry  entry = entry.firstName == firstName && entry.lastName == lastName
-- predicator 인 filterEntry를 local function으로 정의한 모습. (where 키워드를 사용해서)
```

## 중위 함수 적용

대부분의 함수들은 전위표기지만(op lvalue rvalue 순), `==` 와 같은 것들은 중위(lvalue op rvalue) 이진 연산자이다.
`==` 는 `eq` 함수의 중위표기 버전인데, 다음과 같이 정의된 것이다.

```purescript
infix 4 eq as ==
-- 여기 질문!!!!! 4는 무엇이고 왜 등장하는가.. (찾았다: 연산자 우선순위)

-- 따라서 entry.firstName == firstName은 아래와도 같다
eq entry.firstName firstName

-- 혹은 이것과도 같다
eq (_.firstName entry) firstName

-- 혹은 이것과도 같다(모든 신택스 슈거 제거)
eq (\entry -> entry.firstName)
```

`mod` 연산자도 중위표기로 사용할 수 있다.

```purescript
> mod 8 3
-- is equivalent of
> 8 `mod` 3
-- 이처럼 백틱을 사용하면 일반 함수도 중위표기로 변경할 수 있다.
```

중위 연산자는 우측/ 혹은 좌측 결합성을 결정할 수 있다.
|키워드| 이름 | 예시 |
|---|---|---|
| infixl | 좌측 결합 | (a op b op c) eq (a op b) op c))
| infixr | 우측 결합 | (a op b op c) eq (a op (b op c))
| infix | 무결합 | (a op b op c) -> NonAssociativeError, 괄호로 지시해야 함

```purescript
-- john, peggy, ned를 emptyBook에 넣는다고 했을 때, prefix function 사용
book3 = insertEntry john (insertEntry peggy (insertEntry ned emptyBook))

-- infix function 사용 할 때
book4 = john `insertEntry` (peggy `insertEntry` (ned `insertEntry` emptyBook))

-- infixr ++ op로 치환했을 때
infixr 5 insertEntry as ++
book6 = john ++ peggy ++ ned ++ emptyBook

-- infixl ++ op로 치환했을 때
infixr 6 insertEntry as ++
book7 = emptyBook ++ john ++ peggy ++ ned

-- apply 함수를 사용해서 표시한 것
book3 = insertEntry john $ insertEntry peggy $ insertEntry ned emptyBook
{-
위의 `$` 는 apply 함수의 alias.
apply 함수는 다음과 같다.
-}

apply :: forall a b. (a->b) -> a -> b
apply f x = f x
infixr 0 apply as $

{-
여기서의 apply는 사실 일반적인 함수의 적용을 나타낸 것으로 아무런 기능을 하지 않지만
(이는 참조 투명성에 의함)
함수 적용을 중위 연산자로 구조적인 변경을 가능하게 하는 유틸리티성 함수이다.
-}


--이를 감안했을 때, findEntry 는 다음과 같이 작성할 수도 있다.
findEntry :: String -> String -> AddressBook -> Maybe Entry
findEntry firstName lastName book = head $ filter filterEntry book
  where
    filterEntry :: Entry ->Boolean
    filterEntry  entry = entry.firstName == firstName && entry.lastName == lastName
```

## 함수 합성

함수들만을 합성하고 싶을때. 
함수만 파이프로 붙여버리고 싶을때!

```
🍏 -> 🍌 인 함수 A와
🍌 -> 🍅 인 함수 B가 있을 때

A 와 B를 합쳐서
🍏 -> 🍅 인 함수 C를 만들 수 있다
ㄴ 여기서 아무도 바나나의 존재를 알 수도 없고, 관심가질 필요도 없다

함수형 프로그래밍에서의 캡슐화
```

| 연산자 | 이름 | 효과 |
| --- | ---| ---|
| <<< | 후방 합성 | ('b -> 'c) -> ('a -> 'b) -> ('a -> 'c) |
| >>> | 전방 합성 | ('a -> 'b) -> ('b -> 'c) -> ('a -> 'c) |

